## Get Summaries for Visualizing Overall Race Times

#### Categorize And Clean Data

In [1]:
# Try to use Seaborn/Matplotlib to replicate another cool viz from Cole Nusaumbber Knaflic's book Storytelling with Data.
# Inspiration from :
# https://github.com/adamribaudo/storytelling-with-data-ggplot
# Using code from the excellent:
# https://github.com/empathy87/storytelling-with-data

## Import libraries
import numpy as np
import matplotlib
import matplotlib.pyplot as plt 
from matplotlib import transforms
import pandas as pd
import seaborn as sns
from matplotlib.ticker import FixedLocator, FixedFormatter
from pandas import DataFrame

%matplotlib inline

In [9]:
df_Apr = pd.read_csv ('..\Data\April_2022.csv'  )
df_Apr['Month'] = "Apr"

df_Oct= pd.read_csv ('..\Data\October_2022.csv'  )
df_Oct['Month'] = "Oct"

In [3]:
df = pd.concat  ( [  df_Apr , df_Oct ] )

#### Temporary fix up - move this code to Scratch Notebook

In [10]:
df['0K_5K_SECTION_TIME']   = df['5K_MINS']
df['5K_10K_SECTION_TIME']  = df['10K_MINS']  - df['5K_MINS']
df['10K_15K_SECTION_TIME'] = df['15K_MINS']  - df['10K_MINS']
df['15K_20K_SECTION_TIME'] = df['20K_MINS']  - df['15K_MINS']

In [5]:
df.Month.value_counts()

Oct    13160
Apr    11572
Name: Month, dtype: int64

In [6]:
# Now Find the means for each section and Category
df.groupby (['Month' ] ).agg (
     num_runners=('RACE_NUMBER', 'count' )
    ,time_mins = ('CHIP_TIME_MINS', 'mean' )
).reset_index(drop=False)
#df_agg1.sort_values('CATEGORY')

  Month  num_runners   time_mins
0   Apr        11572  130.399274
1   Oct        13160  130.934758

In [7]:
df.loc [ df.CATEGORY.isna(), 'CATEGORY'] = 'NOT_GIVEN'
# There are two 'NOT_GIVEN' rows - drop them

df = df [ df.CATEGORY != 'NOT_GIVEN'  ]

#### Columns

In [8]:
df.columns

Index(['RACE_NUMBER', 'FIRST_NAME', 'SURNAME', 'GENDER', 'GENDER_POSITION',
       'CATEGORY', 'CATEGORY_POSITION', 'CLUB', '5K', '10K', '15K', '20K',
       'OVERALL_POSITION', 'CHIP_TIME', 'CHIP_POSITION', 'CHIP_TIME_MINS',
       '5K_MINS', '10K_MINS', '15K_MINS', '20K_MINS', 'min_per_km_course',
       'min_per_km_0_5', 'min_per_km_6_10', 'min_per_km_11_15',
       'min_per_km_16_20', 'min_per_km_21_FINISH', '5K_10K_SECTION_TIME',
       '10K_15K_SECTION_TIME', '15K_20K_SECTION_TIME', 'Month',
       '0K_5K_SECTION_TIME'],
      dtype='object')

#### How can we group up the ages

In [11]:
# Now Find the means for each section and Category
#df_agg1 =   df.groupby (['CATEGORY', 'Month' ] ).agg (
#     num_runners=('RACE_NUMBER', 'count' )
#    ,time_mins = ('CHIP_TIME_MINS', 'mean' )
#).reset_index(drop=False)
#df_agg1 = df_agg1.sort_values('CATEGORY')

#df_piv = df_agg1.reset_index().pivot( index='CATEGORY' , columns='Month', values=['time_mins', 'num_runners'] ).fillna(0)
#df_piv.head (3)

In [12]:
def flattenHierarchicalCol(col,sep = '_'):
    if not type(col) is tuple:
        return col
    else:
        new_col = ''
        for leveli,level in enumerate(col):
            if not level == '':
                if not leveli == 0:
                    new_col += sep
                new_col += level
        return new_col

#df_piv.columns = df_piv.columns.map(flattenHierarchicalCol)
#df_piv.head(10)

#### Recategorize

In [24]:
df['ANALYSIS_CATEGORY'] = "Normal"

In [25]:
#df.loc [df.CATEGORY.fillna ('No').str.contains ('OPEN')  , 'ENTRY_STATUS'] = "Elite"

boolIndex = np.logical_and ( df.CHIP_TIME_MINS <= 60 + 30  , df.GENDER== 'Male')
df.loc [ boolIndex , 'ANALYSIS_CATEGORY']  = 'Elite'

boolIndex = np.logical_and ( df.CHIP_TIME_MINS <= 60 + 40 , df.GENDER== 'Female')
df.loc [ boolIndex , 'ANALYSIS_CATEGORY']  = 'Elite'

#### Extract our rows from  the dataset.

In [67]:

boolIndex =    ( df.FIRST_NAME.str.contains ('Ellena') ) &\
               ( df.SURNAME.str.contains ( 'Green') )    &\
               (  df.Month == "Apr" )

df.loc [ boolIndex , 'ANALYSIS_CATEGORY']  = 'Us'


boolIndex =    ( df.FIRST_NAME.str.contains ('Ellena') ) &\
               ( df.SURNAME.str.contains ( 'Green') )    &\
               (  df.Month == "Oct" )

df.loc [ boolIndex , 'ANALYSIS_CATEGORY']  = 'Us'




boolIndex =    ( df.FIRST_NAME.str.contains ('John') ) &\
               ( df.SURNAME.str.contains ( 'Steedman') )&\
               (  df.Month == "Apr" )

df.loc [ boolIndex , 'ANALYSIS_CATEGORY']  = 'Us'


boolIndex =    ( df.FIRST_NAME.str.contains ('John') ) &\
               ( df.SURNAME.str.contains ( 'Steedman') )&\
               (  df.Month == "Oct" )

df.loc [ boolIndex , 'ANALYSIS_CATEGORY']  = 'Us'

In [27]:
df.ANALYSIS_CATEGORY.value_counts()

Normal    23261
Elite      1465
Us_Apr        2
Us_Oct        2
Name: ANALYSIS_CATEGORY, dtype: int64

In [68]:
# Now Find the means for each section and Category
df_agg1 =   df.groupby (['ANALYSIS_CATEGORY' , 'GENDER', 'Month' ] ).agg (
     num_runners=('RACE_NUMBER', 'count' )
    ,time_mins = ('CHIP_TIME_MINS', 'mean' )
).reset_index(drop=False)
df_agg1.sort_values('ANALYSIS_CATEGORY')

   ANALYSIS_CATEGORY  GENDER Month  num_runners   time_mins
0              Elite  Female   Apr          146   92.481164
1              Elite  Female   Oct          204   90.855801
2              Elite    Male   Apr          488   82.655977
3              Elite    Male   Oct          627   81.603402
4             Normal  Female   Apr         5030  143.687247
5             Normal  Female   Oct         5516  144.383883
6             Normal    Male   Apr         5906  123.961147
7             Normal    Male   Oct         6809  125.796245
8                 Us  Female   Apr            1  163.250000
9                 Us  Female   Oct            1  134.900000
10                Us    Male   Apr            1  117.400000
11                Us    Male   Oct            1  109.066667

#### Pivot

In [84]:
df_piv = df_agg1.reset_index().pivot( index=['ANALYSIS_CATEGORY', 'GENDER'],
                                      columns=['Month'], 
                                      values=['time_mins'] ).fillna(0).reset_index (drop=False)
df_piv

      ANALYSIS_CATEGORY  GENDER   time_mins
Month                                   Apr         Oct
0                 Elite  Female   92.481164   90.855801
1                 Elite    Male   82.655977   81.603402
2                Normal  Female  143.687247  144.383883
3                Normal    Male  123.961147  125.796245
4                    Us  Female  163.250000  134.900000
5                    Us    Male  117.400000  109.066667

In [85]:
# Useful function 
# https://stackoverflow.com/questions/14507794/how-to-flatten-a-hierarchical-index-in-columns

def flattenHierarchicalCol(col,sep = '_'):
    if not type(col) is tuple:
        return col
    else:
        new_col = ''
        for leveli,level in enumerate(col):
            if not level == '':
                if not leveli == 0:
                    new_col += sep
                new_col += level
        return new_col
    
df_piv.columns = df_piv.columns.map (flattenHierarchicalCol )

df_piv

  ANALYSIS_CATEGORY  GENDER  time_mins_Apr  time_mins_Oct
0             Elite  Female      92.481164      90.855801
1             Elite    Male      82.655977      81.603402
2            Normal  Female     143.687247     144.383883
3            Normal    Male     123.961147     125.796245
4                Us  Female     163.250000     134.900000
5                Us    Male     117.400000     109.066667

#### Improve the labelling

In [86]:
df_piv['Label'] = df_piv.ANALYSIS_CATEGORY
df_piv.loc[(df_piv.Label == 'Us') & (df_piv.GENDER == 'Male') , 'Label'] = 'John'
df_piv.loc[(df_piv.Label == 'Us') & (df_piv.GENDER == 'Female') , 'Label'] = 'John'
df_piv

  ANALYSIS_CATEGORY  GENDER  time_mins_Apr  time_mins_Oct   Label
0             Elite  Female      92.481164      90.855801   Elite
1             Elite    Male      82.655977      81.603402   Elite
2            Normal  Female     143.687247     144.383883  Normal
3            Normal    Male     123.961147     125.796245  Normal
4                Us  Female     163.250000     134.900000    John
5                Us    Male     117.400000     109.066667    John

In [87]:
df_piv.to_csv ( '..\Data\Staging\chart1_data.csv', index=False )